backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 28, 28, 1]
      bias_constraint: null
      bias_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      dtype: float32
      filters: 175
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4, 4]
      name: conv2d_813
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1350
      scale: true
      trainable: true
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_1350, trainable: true}
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1102, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 53
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_814
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1351
      scale: true
      trainable: true
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_1351, trainable: true}
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_94
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
  - class_name: Flatten
    config: {data_format: channels_last, dtype: float32, name: flatten_249, trainable: true}
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1103, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      name: dense_538
      trainable: true
      units: 2
      use_bias: true
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1352
      scale: true
      trainable: true
  - class_name: Activation
    config: {activation: softmax, dtype: float32, name: activation_1352, trainable: true}
  name: sequential_249
keras_version: 2.3.1
